Repository: dataflowslab/core.rompharm
Catalog: core-main/src/frontend/locales/*/translation.po
Languages: ro

source: View submissions
ro: Vezi răspunsurile

source: Warning
ro: Atenție

source: Welcome
ro: Bine ai venit

source: Will be verified with ANAF if provided
ro: Va fi verificat automat la ANAF dacă îl introduci

source: Yes
ro: Da

source: base
ro: bază

source: filter
ro: filtru

source: form
ro: formular

source: part
ro: parte
