Repository: dataflowslab/core.rompharm
Catalog: core-main/src/frontend/locales/*/translation.po
Languages: ro

source: Access Denied
ro: Acces interzis

source: Action
ro: Acțiune

source: Actions
ro: Acțiuni

source: Active
ro: Activ

source: Activity Log
ro: Jurnal activitate

source: Add
ro: Adaugă

source: Add Campaign
ro: Adaugă campanie

source: Add Role
ro: Adaugă rol

source: Add Segment
ro: Adaugă segment

source: Add Subscriber
ro: Adaugă abonat

source: Add User
ro: Adaugă utilizator

source: Add notes...
ro: Adaugă notițe...

source: Admin
ro: Administrator

source: Administration
ro: Administrare

source: Administrator access required
ro: Ai nevoie de acces de administrator

source: Administrator access required to view submissions.
ro: Ai nevoie de acces de administrator ca să vezi răspunsurile.

source: Administrator access required to view this page.
ro: Ai nevoie de acces de administrator ca să vezi această pagină.

source: All Forms
ro: Toate formularele

source: All Submissions
ro: Toate răspunsurile

source: All systems operational
ro: Toate sistemele funcționează

source: Anonymous
ro: Anonim

source: Any file type accepted
ro: Orice tip de fișier este permis

source: Approval
ro: Aprobare

source: Approval workflow not enabled for this form
ro: Fluxul de aprobare nu este activ pentru acest formular

source: Approvals
ro: Avize

source: Are you sure you want to delete this campaign?
ro: Sigur vrei să ștergi această campanie?

source: Are you sure you want to delete this file? This action cannot be undone.
ro: Sigur vrei să ștergi acest fișier? Acțiunea nu este reversibilă.

source: Are you sure you want to delete this form? This action cannot be undone.
ro: Sigur vrei să ștergi acest formular? Acțiunea nu poate fi anulată.

source: Are you sure you want to delete this part?
ro: Sigur vrei să ștergi această parte?

source: Are you sure you want to delete this role? Users with this role may lose access.
ro: Sigur vrei să ștergi acest rol? Utilizatorii cu acest rol se poate să-și piardă accesul.

source: Are you sure you want to delete this segment?
ro: Sigur vrei să ștergi acest segment?

source: Are you sure you want to delete this submission? This action cannot be undone.
ro: Sigur vrei să ștergi acest răspuns? Acțiunea nu poate fi anulată.

source: Are you sure you want to delete this subscriber?
ro: Sigur vrei să ștergi acest abonat?

source: Are you sure you want to delete this user? This action cannot be undone.
ro: Sigur vrei să ștergi acest utilizator? Acțiunea nu este reversibilă.

source: Are you sure you want to send this campaign? It will be processed by the cron job.
ro: Sigur vrei să trimiți campania? Va fi procesată automat de cron.

source: At least one contact method (email or phone) is required
ro: Cel puțin o metodă de contact (email sau telefon) este necesară

source: Audit Log
ro: Jurnal activitate

source: Authentication Required
ro: E nevoie de autentificare

source: Authentication required for this form
ro: E nevoie de autentificare pentru acest formular

source: Authentication required. Please login to submit this form.
ro: Trebuie să te autentifici ca să trimiți acest formular.

source: Author
ro: Autor

source: Back
ro: Înapoi

source: Back to Dashboard
ro: Înapoi la panou

source: Base template to copy content from
ro: Template de bază de unde se copiază conținutul

source: By
ro: De

source: Campaign created successfully
ro: Campania a fost creată cu succes

source: Campaign deleted successfully
ro: Campania a fost ștearsă cu succes

source: Campaign marked for sending. It will be processed by the cron job.
ro: Campania a fost marcată pentru trimitere. Va fi procesată automat de cron.

source: Campaign updated successfully
ro: Campania a fost actualizată cu succes

source: Campaign will be sent automatically at this date/time if active
ro: Campania va fi trmisă automat, dacă este activă, la data și ora specificate

source: Campaigns
ro: Campanii

source: Can Sign
ro: Poate semna

source: Cancel
ro: Anulează

source: Cannot connect to server. Please check if the backend is running.
ro: Nu mă pot conecta la server. Verifică dacă backend-ul rulează.

source: Cererea a fost înregistrată
ro: Cererea ta a fost înregistrată

source: Change State
ro: Schimbă starea

source: Choose from Library
ro: Alege din librărie

source: Coming soon...
ro: În curând...

source: Comma-separated email addresses to notify when a new submission is received
ro: E-mail-uri despărțite prin virgulă la care se vor trimite notificările de completare.

source: Confirm
ro: Confirmă

source: Confirm Submission
ro: Confirmă trimiterea

source: Confirmi trimiterea formularului în forma actuală?
ro: Confirmi că vrei să trimiți formularul așa cum este acum?

source: Consents
ro: Consimțăminte

source: Contact Form
ro: Formular Contact

source: Content
ro: Conținut

source: Content is required
ro: Conținutul este obligatoriu

source: Create
ro: Creează

source: Create Form
ro: Creează Formular

source: Create New Form
ro: Creează Formular Nou

source: Create New Template
ro: Creează Șablon Nou

source: Create Template
ro: Creează Șablon

source: Create your first form to get started.
ro: Creează primul tău formular ca să începi.

source: Created
ro: Creat

source: Current
ro: Curent

source: Data
ro: Date

source: DataFlows Docu is not configured
ro: DataFlows Docu nu este configurat

source: DataFlows Docu is not configured. Please configure it in config.yaml to use document templates.
ro: DataFlows Docu nu este configurat. Te rog configurează-l în config.yaml ca să poți folosi șabloanele de documente.

source: Delete
ro: Șterge

source: Delete Campaign
ro: Șterge Campanie

source: Delete Form
ro: Șterge Formular

source: Delete Part
ro: Șterge Parte

source: Delete Role
ro: Șterge rolul

source: Delete Segment
ro: Șterge Segment

source: Delete Submission
ro: Șterge Răspuns

source: Delete Subscriber
ro: Șterge Abonat

source: Delete User
ro: Șterge userul

source: Delete form
ro: Șterge formular

source: Delete submission
ro: Șterge răspuns

source: Description
ro: Descriere

source: Document Templates
ro: Șabloane Documente

source: Document deleted successfully
ro: Document șters cu succes

source: Document generated successfully!
ro: Document generat cu succes!

source: Documents uploaded successfully
ro: Documentele au fost încărcate cu succes

source: Download
ro: Descarcă

source: Drag file here or click to select
ro: Trage fișierul aici sau clic pentru a-l alege

source: Drag files here or click to select
ro: Trage fișierele aici sau dă click ca să le selectezi

source: Drag image here or click to select
ro: Trage imaginea aici sau dă click ca să alegi

source: Edit
ro: Editează

source: Edit Campaign
ro: Editează campania

source: Edit File
ro: Editează fișierul

source: Edit Form
ro: Editează formularul

source: Edit Role
ro: Editează rolul

source: Edit Segment
ro: Editează segmentul

source: Edit Setting
ro: Editează setarea

source: Edit Subscriber
ro: Editează abonatul

source: Edit Template
ro: Editează șablonul

source: Edit User
ro: Editează utillizatorul

source: Edit form
ro: Editează formular

source: Edit template name
ro: Editează numele șablonului

source: Email marketing consent
ro: Consimțământ pentru email marketing

source: Email template to use for notifications
ro: Șablonul de e-mail folosit pentru notificări

source: Enable Approval Workflow
ro: Activează fluxul de avizare

source: Enable automatic registry numbering for submissions
ro: Activează numerotarea automată a registrului pentru răspunsuri

source: Enter campaign title
ro: Introdu titlul campaniei

source: Enter description
ro: Introdu descrierea

source: Enter email
ro: Introdu emailul

source: Enter file description
ro: Descrierea fișierului

source: Enter file description (optional)
ro: Descrierea fișierului (opțională)

source: Enter file title
ro: Titlul fișierului

source: Enter file title (optional)
ro: Titlul fișierului (opțional)

source: Enter link URL
ro: Introdu linkul URL

source: Enter name
ro: Introdu numele

source: Enter password
ro: Introdu parola

source: Enter phone
ro: Introdu numărul de telefon

source: Enter role description
ro: Introdu descrierea rolului

source: Enter role name
ro: Introdu numele rolului

source: Enter segment name
ro: Introdu numele segmentului

source: Enter tax ID
ro: Introdu codul fiscal

source: Enter username
ro: Introdu numele de utilizator

source: Enter usernames or roles
ro: Introdu numele de utilizatori sau roluri

source: Enter your password
ro: Introdu parola

source: Enter your username
ro: Introdu numele de utilizator

source: Error
ro: Eroare

source: Example array:
ro: Exemplu matrice:

source: Failed to create template
ro: Nu am putut crea șablonul

source: Failed to delete campaign
ro: Nu am putut șterge campania

source: Failed to delete document
ro: Nu am putut șterge documentul

source: Failed to delete file
ro: Nu am putut șterge fișierul

source: Failed to delete files
ro: Nu am putut șterge fișierele

source: Failed to delete form
ro: Nu am putut șterge formularul

source: Failed to delete part
ro: Nu am putut șterge partea

source: Failed to delete role
ro: Nu am putut șterge rolul

source: Failed to delete segment
ro: Nu am putut șterge segmentul

source: Failed to delete submission
ro: Nu am putut șterge răspunsul

source: Failed to delete subscriber
ro: Nu am putut șterge abonatul

source: Failed to delete user
ro: Nu am putut șterge utilizatorul

source: Failed to download file
ro: Nu am putut șterge fișierul

source: Failed to generate document
ro: Nu am putut descărca fișierul

source: Failed to import from InvenTree
ro: Nu am putut importa din InvenTree

source: Failed to load campaigns
ro: Nu am putut încărca campaniile

source: Failed to load files
ro: Nu am putut încărca fișierele

source: Failed to load form
ro: Nu am putut încărca formularul

source: Failed to load forms
ro: Nu am putut încărca formularele

source: Failed to load part content
ro: Nu am putut încărca conținutul părții

source: Failed to load registries
ro: Nu am putut încărca registrele

source: Failed to load roles
ro: Nu am putut încărca rolurile

source: Failed to load segments
ro: Nu am putut încărca segmentele

source: Failed to load settings
ro: Nu am putut încărca setările

source: Failed to load submission
ro: Nu am putut încărca răspunsul

source: Failed to load submissions
ro: Nu am putut încărca răspunsurile

source: Failed to load subscribers
ro: Nu am putut încărca abonații

source: Failed to load template content
ro: Nu am putut încărca conținutul șablonului

source: Failed to load templates
ro: Nu am putut încărca șabloanele

source: Failed to load users
ro: Nu am putut încărca utilizatorii

source: Failed to save campaign
ro: Nu am putut salva campania

source: Failed to save part
ro: Nu am putut salva partea

source: Failed to save role
ro: Nu am putut salva rolul

source: Failed to save segment
ro: Nu am putut salva segmentul

source: Failed to save setting
ro: Nu am putut salva setările

source: Failed to save subscriber
ro: Nu am putut salva abonatul

source: Failed to save user
ro: Nu am putut salva utilizatorul

source: Failed to send campaign
ro: Nu am putut trimite campania

source: Failed to sign submission
ro: Nu am putut semna solicitarea

source: Failed to submit form. Please try again.
ro: Nu am putut trimite formularul. Încearcă din nou.

source: Failed to update file
ro: Nu am putut actualiza fișierul

source: Failed to update state
ro: Nu am putut actualiza starea

source: Failed to update template
ro: Nu am putut actualiza șablonul

source: Failed to upload documents
ro: Nu am putut încărca documentele

source: Failed to upload file
ro: Nu am putut încărca fișierul

source: Failed to upload image
ro: Nu am putut încărca imaginea

source: File deleted successfully
ro: Fișier eliminat cu succes

source: File updated successfully
ro: Fișier actualizat cu succes

source: File uploaded successfully
ro: Fișier încărcat cu succes

source: Files deleted successfully
ro: Fișier eliminat cu succes

source: Filter by form
ro: Filtrează după formular

source: For JSON arrays/objects, use proper JSON format with quotes
ro: Pentru obiecte JSON, folosește formatul JSON cu ghilimele duble

source: For plain text (like email content), just type normally
ro: Pentru plain text, scrie textul normal

source: Force regenerate document even if already exists
ro: Forțează regenerarea documentelor chiar dacă există

source: Form
ro: Formular

source: Form Submissions
ro: Răspunsuri Formular

source: Form Summary
ro: Rezumat Formular

source: Form Title
ro: Titlu Formular

source: Form created successfully
ro: Formular creat cu succes

source: Form deleted successfully
ro: Formular șters cu succes

source: Form description...
ro: Descrierea formularului...

source: Form not found
ro: Formularul nu a fost găsit

source: Form submitted successfully!
ro: Formular trimis cu succes!

source: Form updated successfully
ro: Formular actualizat cu succes

source: Forms
ro: Formulare

source: Forms Management
ro: Management Formulare

source: Generate Document
ro: Generează Document

source: Generate Documents
ro: Generează documente

source: Grant full administrative access
ro: Oferă acces administrativ

source: Has Registry
ro: Are registru

source: History
ro: Istoric

source: IP Address
ro: Adresă IP

source: Image
ro: Imagine

source: Image should not exceed 5MB
ro: Imaginea nu trebuie să depășească 5MB

source: Image uploaded successfully
ro: Imagine încărcată cu succes

source: Import from InvenTree
ro: Importă din InvenTree

source: Imported
ro: Importat

source: Inactive
ro: Inactiv

source: Invalid InvenTree credentials. Please check your username and password.
ro: Datele de autentificare InvenTree sunt invalide. Verifică numele de utilizator și parola.

source: Invalid file type. Please upload an image.
ro: Tip de fișier invalid. Te rog încarcă o imagine.

source: InvenTree Mode
ro: Mod DataFlows Docu

source: JSON Forms Documentation
ro: Documentație JSON Forms

source: JSON Schema
ro: Schema JSON

source: JavaScript code
ro: Cod JavaScript

source: Key
ro: Cheie

source: Last Login
ro: Ultima autentificare

source: Last Updated
ro: Ultima actualizare

source: Last updated
ro: Ultima actualizare

source: Leave empty to keep current
ro: Lasă gol pentru a păstra valoarea curentă

source: Library
ro: Librărie

source: Load More
ro: Încarcă mai mult

source: Loading audit logs...
ro: Se încarcă jurnalul...

source: Loading campaigns...
ro: Se încarcă campaniile...

source: Loading files...
ro: Se încarcă fișierele...

source: Loading form...
ro: Se încarcă formularul...

source: Loading forms...
ro: Se încarcă formularele...

source: Loading notifications...
ro: Se încarcă notificările...

source: Loading registries...
ro: Se încarcă registrele...

source: Loading roles...
ro: Se încarcă rolurile...

source: Loading segments...
ro: Se încarcă segmentele...

source: Loading settings...
ro: Se încarcă setările...

source: Loading submission...
ro: Se încarcă răspunsul...

source: Loading submissions...
ro: Se încarcă răspunsurile...

source: Loading subscribers...
ro: Se încarcă abonații...

source: Loading templates...
ro: Se încarcă șabloanele...

source: Loading users...
ro: Se încarcă utilizatorii...

source: Login
ro: Autentificare

source: Logout
ro: Deconectare

source: Message
ro: Mesaj

source: Metadata
ro: Metadate

source: Minimum Number of Signatures
ro: Nr minim de semnături

source: Minimum Signatures
ro: Minimum de semnături

source: Minimum signatures required for approval
ro: Nr minim de semnături necesare pentru avizare

source: Modified
ro: Modificat

source: Must Sign
ro: Trebuie să semneze

source: My Files
ro: Fișierele mele

source: My Template
ro: Șablonul Meu

source: Name
ro: Nume

source: Need help with JSON Schema or UI Schema?
ro: Ai nevoie de ajutor cu Schema JSON sau Schema UI?

source: Never
ro: Niciodată

source: New Template
ro: Șablon Nou

source: No
ro: Nu

source: No audit logs found
ro: Nu am găsit niciun jurnal

source: No campaigns
ro: Nicio campanie

source: No campaigns found. Create your first campaign to send to subscribers.
ro: Nu am găsit nicio campanie. Creează prima ta campanie ca să le trimiți abonaților.

source: No configuration entries found in the database.
ro: Nu există setări disponibile

source: No files
ro: Nu sunt fișiere

source: No files found in this section.
ro: Nu sunt fișiere în această secțiune

source: No files found matching your search.
ro: Nu găsesc fișiere după criteriile tale de căutare.

source: No files found. Upload files to the library first.
ro: NU sunt fișiere. Încarcă fișiere în librărie.

source: No form shortcuts configured
ro: Nu sunt scurtături configurate

source: No forms with registries found. Enable registry on a form to see it here.
ro: Nu sunt registre configurate. Activează registrul pentru un formular și îl vei vedea aici.

source: No forms yet
ro: Niciun formular încă

source: No history
ro: Niciun istoric

source: No notifications
ro: Nicio notificare

source: No registries
ro: Nu sunt registre

source: No roles found
ro: Nu sunt roluri

source: No roles found. Create your first role to assign to users.
ro: Nu sunt roluri. Crează primul rol.

source: No segments
ro: Niciun segment

source: No segments found. Add your first segment to organize subscribers.
ro: Nu am găsit niciun segment. Adaugă primul tău segment ca să organizezi abonații.

source: No settings
ro: Nu sunt setări

source: No signers configured. Add at least one signer to enable approval workflow.
ro: Nu sunt semnatari definiți. Adaugă măcar unul pentru activarea fluxului de avizare.

source: No submissions
ro: Niciun răspuns

source: No submissions found matching your criteria.
ro: Nu sunt răspunsuri

source: No submissions found matching your search.
ro: Nu sunt răspunsuri

source: No submissions found.
ro: Nu am găsit niciun răspuns.

source: No submissions yet
ro: Niciun răspuns încă

source: No subscribers
ro: Niciun abonat

source: No subscribers found. Add your first subscriber or import from InvenTree.
ro: Nu am găsit niciun abonat. Adaugă primul abonat sau importă din InvenTree.

source: No templates available
ro: Niciun șablon disponibil

source: No templates available in DataFlows Docu
ro: Niciun șablon disponibil în DataFlows Docu

source: No templates configured for this form
ro: Nu sunt șabloane configurate pentru acest formular

source: No templates found
ro: Nu am găsit niciun șablon

source: No uploaded documents
ro: Nu sunt documente încărcate

source: No users found
ro: Nu am găsit niciun utilizator

source: No users found. Create your first user.
ro: Nu sunt utilizatori. Crează primul utilizator.

source: Not Found
ro: De negăsit

source: Notes
ro: Notițe

source: Notification Emails
ro: Șablon e-mail

source: Notification Template
ro: Șablon notificări

source: Notifications
ro: Notificări

source: Notify author
ro: Anunță autorul

source: Owner
ro: Proprietar

source: Part Type
ro: Tip parte

source: Part deleted successfully
ro: Partea a fost ștearsă cu succes

source: Part updated successfully
ro: Partea a fost actualizată cu succes

source: Password
ro: Parolă

source: Password is required for new users
ro: Este necesară o parolă pentru utilizatori noi

source: Pending
ro: În așteptare

source: Phone
ro: Telefon

source: Please login to submit this form
ro: Te rog autentifică-te ca să trimiți acest formular

source: Please select a file
ro: Alege un fișier

source: Preview
ro: Previzualizare

source: Preview not available for this file type
ro: Previzualizarea nu este disponibilă

source: Processing
ro: În procesare

source: Protected
ro: Protejat

source: Protected Form
ro: Formular Protejat

source: Public Form
ro: Formular Public

source: Public forms can be filled by anyone. Protected forms require authentication.
ro: Formularele publice pot fi completate de oricine. Formularele protejate cer autentificare.

source: Quick Actions
ro: Acțiuni rapide

source: Recent Activity
ro: Activitate recentă

source: Recent Submissions
ro: Răspunsuri Recente

source: Regenerate
ro: Regenrează

source: Registers
ro: Registre

source: Registry
ro: Registru

source: Registry #
ro: Registru #

source: Registry Settings
ro: Setări registru

source: Role
ro: Rol

source: Role Name
ro: Nume rol

source: SMS marketing consent
ro: Consimțământ pentru SMS marketing

source: Save
ro: Salvează

source: Scheduled At
ro: Programat la

source: Search files...
ro: Caută în fișiere...

source: Search...
ro: Caută...

source: Segment created successfully
ro: Segment creat cu succes

source: Segment deleted successfully
ro: Segment șters cu succes

source: Segment updated successfully
ro: Segment actualizat cu succes

source: Segments
ro: Segmente

source: Select date and time
ro: Alege data și ora

source: Select email template
ro: Alege șablonul de e-mail

source: Select segment
ro: Selectează segment

source: Select segments
ro: Selectează segmente

source: Select templates
ro: Selectează șabloane

source: Select templates for document generation
ro: Selectează șabloane pentru generarea documentelor

source: Select the type of template part to create
ro: Selectează tipul părții de șablon pe care vrei să o creezi

source: Send Campaign
ro: Trimite Campania

source: Sent Count
ro: Număr Trimise

source: Skipped
ro: Sărite

source: Standard CSS syntax
ro: Sintaxă CSS standard

source: Start
ro: Începe

source: Start With
ro: Începe cu

source: Starting number for registry (will auto-increment)
ro: Primul nr. din registru (autoincrementabil)

source: State
ro: Stare

source: State updated successfully
ro: Stare actualizată cu succes

source: Submission Details
ro: Detalii Răspuns

source: Submission deleted successfully
ro: Răspuns șters cu succes

source: Submission not found
ro: Răspunsul nu a fost găsit

source: Submissions (30 days)
ro: Înregistrări (30 zile)

source: Submissions (7 days)
ro: Înregistrări (7 zile)

source: Submit
ro: Trimite

source: Submitted At
ro: Trimis La

source: Submitted By
ro: Trimis De

source: Subscriber created successfully
ro: Abonat creat cu succes

source: Subscriber deleted successfully
ro: Abonat șters cu succes

source: Subscriber updated successfully
ro: Abonat actualizat cu succes

source: Subscribers
ro: Abonați

source: Success
ro: Succes

source: System Notifications
ro: Notificări Sistem

source: Tax ID
ro: Cod fiscal

source: Tax ID (CUI/CIF)
ro: Cod fiscal (CUI/CIF)

source: Template Name
ro: Nume Șablon

source: Template Parts
ro: Părți Șablon

source: Template created successfully
ro: Șablon creat cu succes

source: Template name is required
ro: Numele șablonului este obligatoriu

source: Templates
ro: Șabloane

source: The DataFlows Docu server may be experiencing issues with the /raw endpoint.
ro: Serverul DataFlows Docu poate avea probleme cu endpoint-ul /raw.

source: This action cannot be undone.
ro: Acțiunea asta nu poate fi anulată.

source: This is a protected form. You need to login to access it.
ro: Acesta este un formular protejat. Trebuie să te autentifici ca să-l accesezi.

source: Timestamp
ro: Data/Ora

source: Title
ro: Titlu

source: Total Submissions
ro: Total înregistrări

source: Type
ro: Tip

source: UI Schema (optional)
ro: Schema UI (opțional)

source: Unable to load template content. Please try again later or contact support.
ro: Nu pot încărca conținutul șablonului. Încearcă mai târziu sau contactează suportul.

source: Update
ro: Actualizează

source: Update State
ro: Actualizează Starea

source: Uploaded Documents
ro: Documente încărcate

source: Use Jinja2 syntax: {{variable}}, {% for %}, {% if %}
ro: Folosește sintaxa Jinja2: {{variable}}, {% for %}, {% if %}

source: User
ro: Utilizator

source: Username
ro: Utilizator

source: Users
ro: Utilizatori

source: View Documentation
ro: Vezi Documentația

source: View details
ro: Vezi detalii
